{
  "journal": [
    {
      "text": "Editorial Board, IEEE Access, IEEE Press, 2019~now. (SCI/EI)"
    },
    {
      "text": "Editorial Board, Discover Sensors, Springer Nature Press, 2024~now."
    },
    {
      "text": "Editorial Advisory Board, Heliyon, Cell Press, 2019~now. (SCI)"
    },
    {
      "text": "Guest Editor, International Journal of Web and Grid Services, Special Issue on Web Mining and Pervasive computing in Cloud-based Environments, Inderscience Press, 2016. (SCI/EI)"
    }
  ],
  "technical": [
    {
      "text": "IEEE CTSoc TC IoT, Internet of Things, Internet of Everywhere and Edge Computing (IoT), IEEE Consumer Technology Society, 2025~now"
    }
  ],
  "chairIntl": [
    {
      "text": "Local Arrangement Chair, AINA 2017: The 31st IEEE International Conference on Advanced Information Networking and Applications, New Taipei, Taiwan. (EI)"
    },
    {
      "text": "Program Committee Co-Chair, NBiS 2015: The 18th International Conference on Network-Based Information Systems, Taipei, Taiwan. (EI)"
    },
    {
      "text": "Steering Committee Member, CSCI 2014-2021: International Conference on Computational Science and Computational Intelligence, Las Vegas, Nevada, USA. (EI)"
    },
    {
      "text": "Local Arrangement Chair, iCube 2011: The 3rd International Conference on University Basic computers education and eLearning, Taipei, Taiwan."
    },
    {
      "text": "Local Arrangement Chair, CSCIST 2011: The 5th Cross-Strait Conference on Information Science and Technology, Taipei, Taiwan."
    },
    {
      "text": "Local Arrangement Chair, iCube 2010: The 2nd International Conference on University Basic computers education and eLearning, Taipei, Taiwan."
    }
  ],
  "sessionOrg": [
    {
      "text": "Special Session Organizer, IEEE ISPACS 2021: International Symposium on Intelligent Signal Processing and Communication Systems: AIoT Communications, Protocols, and Applications, Hualien, Taiwan. (EI)"
    }
  ],
  "program": [
    {
      "text": "IEEE WCNC 2025: IEEE Wireless Communications and Networking Conference, Mico Milano Congressi, Milan, Italy. (EI)"
    },
    {
      "text": "APNOMS 2025: The 25th Asia-Pacific Network Operations and Management Symposium, Kaohsiung, Taiwan. (EI)"
    },
    {
      "text": "ACIIDS 2025: The 17th Asian Conference on Intelligent Information and Database Systems, Kitakyushu, Japan. (EI)"
    },
    {
      "text": "IEEE CyberSciTech 2024:\tThe 9th IEEE Cyber Science and Technology Congress, Boacay Island, Malay, Philippines. (EI)"
    },
    {
      "text": "IEEE COMNETSAT 2024: The 13th IEEE International Conference on Communication, Networks and Satellite, Lombok, Indonesia. (EI)"
    },
    {
      "text": "ICoAILO 2024: IEEE International Conference on Artificial Intelligence for Learning and Optimization, Kabupaten Badung, Bali. (EI)"
    },
    {
      "text": "ICICoS 2024: International Conference on Informatics and Computational Sciences,  Semarang, Indonesia. (EI)"
    },
    {
      "text": "IEEE WCNC 2024: IEEE Wireless Communications and Networking Conference, Dubai, United Arab Emirates. (EI)"
    },
    {
      "text": "CCCIS 2024: The 4th International Conference on Computer Communication and Information Systems, Phuket, Thailand. (EI)"
    },
    {
      "text": "ACIIDS 2024: The 16th Asian Conference on Intelligent Information and Database Systems, Ras Al Khaimah, UAE. (EI)"
    },
    {
      "text": "IEEE BigData 2023: IEEE International Conference on Big Data, Sorrento, Italy. (EI)"
    },
    {
      "text": "ICNCC 2023: The 12th International Conference on Networks, Communication and Computing, Osaka, Japan. (EI)"
    },
    {
      "text": "INCENTIVE 2023: International Conference of Electrical Engineering, Informatics, Industrial Technology, and Creative Media, Purwokerto, Indonesia. (EI)"
    },
    {
      "text": "ISI 2023: International Symposium on Intelligent Informatics, Bangalore, India. (EI)"
    },
    {
      "text": "ACN 2023: International Conference on Applied Soft computing and Communication Networks, Bangalore, India. (EI)"
    },
    {
      "text": "EEE COMNETSAT 2023: The 12th IEEE International Conference on Communication, Networks and Satellite, Malang, Indonesia. (EI)"
    },
    {
      "text": "SSCC 2023: The 9th International Symposium on Security in Computing and Communications, Bangalore, India. (EI)"
    },
    {
      "text": "STA 2023: International Symposium on Intelligent Systems Technologies and Applications, Bangalore, India. (EI)"
    },
    {
      "text": "oCoNet 2023: The 5th International Conference on Computing and Network Communications, Bengaluru (Bangalore), India. (EI)"
    },
    {
      "text": "APNOMS 2023: The 24th Asia-Pacific Network Operations and Management Symposium, Sejong, Korea. (EI)"
    },
    {
      "text": "IEEE WCNC 2023: IEEE Wireless Communications and Networking Conference, Glasgow, Scotland, UK. (EI)"
    },
    {
      "text": "ACIIDS 2023: The 15th Asian Conference on Intelligent Information and Database Systems, Phuket, Thailand. (EI)"
    },
    {
      "text": "IEEE BigData 2022: IEEE International Conference on Big Data, Osaka, Japan. (EI)"
    },
    {
      "text": "IEEE MENACOMM 2022: IEEE Middle East & North Africa COMMunications Conference, Amman, Jordan. (EI)"
    },
    {
      "text": "ICIST 2022: The 4th International Conference on Innovation in Science Technology, Semarang, Indonesia."
    },
    {
      "text": "ICICoS 2022: International Conference on Informatics and Computational Sciences,  Semarang, Indonesia. (EI)"
    },
    {
      "text": "APNOMS 2022: The 23rd Asia-Pacific Network Operations and Management Symposium, Takamatsu, Japan. (EI)"
    },
    {
      "text": "IEEE CyberneticsCom 2022: The 2022 IEEE International Conference on Cybernetics and Computational Intelligence, East Java, Indonesia. (EI)"
    },
    {
      "text": "ISI 2022: International Symposium on Intelligent Informatics, Kerala, India. (EI)"
    },
    {
      "text": "CSI 2022: The 2022 International Conference on Connected Systems & Intelligence, Kerala, India. (EI)"
    },
    {
      "text": "IEEE WCNC 2022: IEEE Wireless Communications and Networking Conference, Austin, USA. (EI)"
    },
    {
      "text": "IEEE MENACOMM 2021: IEEE Middle East & North Africa COMMunications Conference, Agadir, Morocco. (EI)"
    },
    {
      "text": "IEEE CyberSciTech 2021: IEEE Cyber Science and Technology Congress, Virtual Conference. (EI)"
    },
    {
      "text": "WOCC 2021: The 30th Wireless and Optical Communications Conference, Taipei, Taiwan. (EI)"
    },
    {
      "text": "3ICT 2021: International Conference on Innovation and Intelligence for Informatics, Computing, and Technologies, Zallaq, Bahrain. (EI)"
    },
    {
      "text": "APNOMS 2021: The 22nd Asia-Pacific Network Operations and Management Symposium, Tainan, Taiwan. (EI)"
    },
    {
      "text": "IEEE WCNC 2021: IEEE Wireless Communications and Networking Conference, Nanjing, China. (EI)"
    },
    {
      "text": "ICCAIS 2021: The 4th International Conference on Computer Applications & Information Security, Riyadh, Saudi Arabia. (EI)"
    },
    {
      "text": "ICS 2020: 2020 International Computer Symposium, Tainan, Taiwan. (EI)"
    },
    {
      "text": "3ICT 2020: International Conference on Innovation and Intelligence for Informatics, Computing, and Technologies, Zallaq, Bahrain. (EI)"
    },
    {
      "text": "ICNCC 2020: The 9th International Conference on Networks, Communication and Computing, Tokyo, Japan. (EI)"
    },
    {
      "text": "ACN 2020: International Conference on Applied Soft computing and Communication Networks, Chennai, India. (EI)"
    },
    {
      "text": "ISTA 2020: International Symposium on Intelligent Systems Technologies and Applications, Chennai, India."
    },
    {
      "text": "IEEE WCNC 2020\tIEEE Wireless Communications and Networking Conference, Seoul, South Korea. (EI)"
    },
    {
      "text": "IADS Workshop – ICPR 2020: Workshop on Integrated Artificial Intelligence in Data Science, jointed with ICPR 2020 (The 25th International Conference on Pattern Recognition, Milan, Italy.) (EI)"
    },
    {
      "text": "3ICT 2019: International Conference on Innovation and Intelligence for Informatics, Computing, and Technologies, Zallaq, Bahrain. (EI)"
    },
    {
      "text": "IEEE MENACOMM 2019: The 2nd IEEE Middle East & North Africa COMMunications Conference, Manama, Bahrain. (EI)"
    },
    {
      "text": "ICACCI 2019: International Conference on Advances in Computing, Communications and Informatics, Trivandrum, Kerala, India. (EI)"
    },
    {
      "text": "IEEE CyberSciTech 2019: IEEE Cyber Science and Technology Congress, Fukuoka, Japan. (EI)"
    },
    {
      "text": "IEEE WCNC 2019: IEEE Wireless Communications and Networking Conference, Marrakech, Morocco. (EI)"
    },
    {
      "text": "IEEE SmartWorld 2018: The 4th IEEE International SmartWorld Congress, Guangzhou, China. (EI)"
    },
    {
      "text": "ISI 2018: International Symposium on Intelligent Informatics, Bangalore, India. (EI)"
    },
    {
      "text": "IEEE CyberSciTech 2018: IEEE Cyber Science and Technology Congress, Athens, Greece. (EI)"
    },
    {
      "text": "ISTA 2018: International Symposium on Intelligent Systems Technologies and Applications, Bangalore, India."
    },
    {
      "text": "ICACCI 2018: International Conference on Advances in Computing, Communications and Informatics, Bangalore, India. (EI)"
    },
    {
      "text": "SCS-NCC 2018: The 21st Saudi Computer Society National Computer Conference, Saudi Arabia. (EI)"
    },
    {
      "text": "ICCISN 2018: International Conference on Computer Intelligent Systems & Networking, Sousse, Tunisia. (EI)"
    },
    {
      "text": "IEEE CyberSciTech 2017: IEEE  Cyber Science and Technology Congress, Orlando, USA. (EI)"
    },
    {
      "text": "IEEE SmartWorld 2017: The  3rd IEEE International SmartWorld Congress, 2017, San Francisco, USA. (EI)"
    },
    {
      "text": "ISI 2017: International  Symposium on Intelligent Informatics, Karnataka, India."
    },
    {
      "text": "ISTA 2017:\tInternational Symposium on Intelligent Systems Technologies and Applications, Manipal, India."
    },
    {
      "text": "NBiS 2017: The  20th International Conference on Network-Based Information  Systems, Toronto, Canada. (EI)"
    },
    {
      "text": "ICACCI 2017: International  Conference on Advances in Computing, Communications and Informatics, Karnataka,  India."
    },
    {
      "text": "IEEE WCNC 2016: IEEE  Wireless Communications and Networking Conference, Doha, Qatar. (EI)"
    },
    {
      "text": "IEEE ICCVE 2016: IEEE  International Conference on Connected Vehicles & Expo, Seattle, WA, USA. (EI)"
    },
    {
      "text": "ICITeS 2016: International  Conference on Information Technology & e-Services, Sousse, Tunisia."
    },
    {
      "text": "ISI 2016: International  Symposium on Intelligent Informatics, Jaipur, India."
    },
    {
      "text": "ISTA 2016:\tInternational Symposium on Intelligent Systems Technologies and Applications, Jaipur, India."
    },
    {
      "text": "SelfNet 2016:\tInternational Workshop on Security in Self-Organising Networks, Jaipur, India."
    },
    {
      "text": "ICACCI 2016: International  Conference on Advances in Computing, Communications and Informatics, Jaipur,  India."
    },
    {
      "text": "IEEE ICCVE 2015: IEEE  International Conference on Connected Vehicles & Expo, Shenzhen, China. (EI)"
    },
    {
      "text": "ISTA 2015: International  Symposium on Intelligent Systems Technologies and Applications, India."
    },
    {
      "text": "EWSN-AP 2015: International  Workshop on Emerging Wireless Sensors Network Applications, Singapore."
    },
    {
      "text": "ICACCI 2015: International  Conference on Advances in Computing, Communications and Informatics, luva,  Kochi, India."
    },
    {
      "text": "IEEE SPICES 2015: IEEE  International Conference on Signal Processing, Informatics, Communication and  Energy Systems, Kerala, India."
    },
    {
      "text": "IEEE WCNC 2015:\tIEEE Wireless Communications and Networking Conference, New Orleans, USA. (EI)"
    },
    {
      "text": "IEEE ICCVE 2014:\tThe International Conference on Connected Vehicles & Expo, Vienna, Austria. (EI)"
    },
    {
      "text": "SelfNet 2014: International Workshop on Security in Self-Organising Networks, Trivandrum, India."
    },
    {
      "text": "ISI 2014:\tInternational  Symposium on Intelligent Informatics, Delhi, India."
    },
    {
      "text": "ICACCI 2014:\tInternational  Conference on Advances in Computing, Communications and Informatics, Greater Noida,  India."
    },
    {
      "text": "IEEE WCNC 2014:\tIEEE Wireless Communications and Networking Conference, Istanbul, Turkey. (EI)"
    },
    {
      "text": "CSCIST 2013: The 7th Cross-Strait Conference on Information Science and Technology, Taipei, Taiwan."
    },
    {
      "text": "IEEE ICCVE 2013:\tThe International Conference on Connected Vehicles & Expo, Las Vegas, USA. (EI)"
    },
    {
      "text": "CSCIST 2013:\tThe 7th Cross-Strait Conference on Information Science and Technology, Taipei, Taiwan."
    },
    {
      "text": "ISI 2013:\tInternational  Symposium on Intelligent Informatics, Mysore, India."
    },
    {
      "text": "ICACCI 2013:\tInternational  Conference on Advances in Computing, Communications and Informatics, Mysore,  India."
    },
    {
      "text": "IEEE WCNC 2013:\tIEEE Wireless Communications and Networking Conference, Shanghai, China. (EI)"
    },
    {
      "text": "SelfNet 2012:\tWorkshop on Security in Self-Organising Networks, Trivandrum, India."
    },
    {
      "text": "CISIS 2012:\tThe 6th International Conference on Complex, Intelligent, and Software Intensive Systems, Palermo, Italy."
    },
    {
      "text": "IEEE ComComAp 2012:\tComputers, Communications and IT Applications Conference, Hong Kong, China. (EI)"
    },
    {
      "text": "CSCIST 2011:\tThe 5th Cross-Strait Conference on Information Science and Technology, Taipei, Taiwan."
    },
    {
      "text": "iCube 2011:\tThe 3rd International Conference on University Basic computers education and eLearning, Taipei, Taiwan."
    },
    {
      "text": "NBiS 2011:\tThe 14th International Conference on Network-Based Information Systems, Tirana, Albnia."
    },
    {
      "text": "IEEE ICCT 2011:\tThe 12th IEEE International Conference on Communication Technology, Tokyo, Japan . (EI)"
    },
    {
      "text": "IEEE INFOCOM 2011:\tThe 30th IEEE International Conference on Computer Communications, Shanghai, China. (EI)"
    },
    {
      "text": "ACC 2011:\tThe International Conference on Advances in Computing and Communications, Kerala, India. (EI)"
    },
    {
      "text": "iCube 2010:\tThe 2nd International Conference on University Basic computers education and eLearning, Taipei, Taiwan."
    },
    {
      "text": "CSCIST 2010:\tThe 4th Cross-Strait Conference on Information Science and Technology, Hebei, China."
    },
    {
      "text": "IEEE WCNC 2010:\tThe IEEE Wireless Communications & Networking Conference, Sydney, Australia. (EI)"
    },
    {
      "text": "iCube 2009:\tThe 1st International Conference on University Basic computers education and eLearning, Taipei, Taiwan."
    },
    {
      "text": "IEEE GLOBECOM 2007:\tIEEE Global Communications Conference, Washington, USA. (EI)"
    },
    {
      "text": "IEEE BodyNets 2007:\tIEEE International Conference on Body Area Networks, Florence, Italy. (EI)"
    },
    {
      "text": "IEEE ICC 2006:\tIEEE International Conference on Communications, Istanbul, Turkey. (EI)"
    }
  ],
  "reviewerIntJ": [
    {
      "publisher": "ACM 出版社",
      "journals": [
        {
          "text": "ACM Transactions on Sensor Networks, 2022~now"
        }
      ]
    },
    {
      "publisher": "IEEE 出版社",
      "journals": [
        {
          "text": "IEEE Transactions on Instrumentation and Measurement (SCI/EI), 2022~now"
        },
        {
          "text": "IEEE Transactions on Automation Science and Engineering (SCI/EI), 2021~now"
        },
        {
          "text": "IEEE Transactions on Vehicular Technology (SCI/EI), 2021~now"
        },
        {
          "text": "IEEE Internet of Things Journal (SCI/EI), 2021~now"
        },
        {
          "text": "IEEE Systems Journal (SCI/EI), 2020~now"
        },
        {
          "text": "IEEE Access (SCI/EI), 2019~now"
        },
        {
          "text": "IEEE Communications Letters (SCI/EI), 2019~now"
        },
        {
          "text": "IEEE Transactions on Cybernetics (SCI/EI), 2019~now"
        },
        {
          "text": "IEEE Transactions on Network and Service Management (SCI/EI), 2018~now"
        },
        {
          "text": "IEEE Transactions on Mobile Computing (SCI/EI), 2018~now"
        },
        {
          "text": "IEEE Transactions on Systems, Man, and Cybernetics: Systems (SCI/EI), 2017~now"
        },
        {
          "text": "IEEE Transactions on Industrial Informatics (SCI/EI), 2017~now"
        },
        {
          "text": "IEEE Transactions on Reliability (SCI/EI), 2017~now"
        },
        {
          "text": "IEEE Transactions on Wireless Communications (SCI/EI), 2016~now"
        },
        {
          "text": "IEEE Journal on Selected Areas in Communications (SCI/EI), 2015~now"
        },
        {
          "text": "IEEE Embedded Systems Letters (SCI/EI), 2015~now"
        },
        {
          "text": "IEEE Sensors Journal (SCI/EI), 2011~now"
        },
        {
          "text": "IEEE Transactions on Parallel and Distributed Systems (SCI/EI), 2011~now"
        }
      ]
    },
    {
      "publisher": "Elsevier 出版社",
      "journals": [
        {
          "text": "Ad  Hoc Networks, 2015~now"
        },
        {
          "text": "Journal  of Network and Computer Applications, 2011~now"
        },
        {
          "text": "Journal of Parallel and Distributed Computing, 2013~now"
        },
        {
          "text": "Journal of Systems and Software, 2009~now"
        }
      ]
    },
    {
      "publisher": "Springer 出版社",
      "journals": [
        {
          "text": "Wireless Networks,2019~now"
        },
        {
          "text": "The Journal of Supercomputing,2012~now"
        },
        {
          "text": "Telecommunication System, 2014~now"
        },
        {
          "text": "EURASIP  Journal on Wireless Communications and Networking, 2011~now"
        }
      ]
    },
    {
      "publisher": "IET 出版社",
      "journals": [
        {
          "text": "IET Communications, 2011~now"
        },
        {
          "text": "IET Networks, 2014~now"
        }
      ]
    },
    {
      "publisher": "SAGE 出版社",
      "journals": [
        {
          "text": "International Journal of Distributed Sensor Networks, 2012~now"
        }
      ]
    },
    {
      "publisher": "Inderscience 出版社",
      "journals": [
        {
          "text": "International Journal of Ad Hoc and Ubiquitous Computing, 2013~now"
        }
      ]
    },
    {
      "publisher": "MDPI 出版社",
      "journals": [
        {
          "text": "Sensors, 2016~now"
        }
      ]
    }
  ],
  "invited": [
    {
      "text": "中興大學資訊科學與工程研究所\"無線感測網路之覆蓋問題\", 演講者, \t2018.06.29"
    },
    {
      "text": "臺灣科技大學資訊工程研究所\t\"無線感測網路之覆蓋問題\", 演講者, \t2018.04.30"
    },
    {
      "text": "中央大學機械工程學系\t\"可靠計算\", 演講者, \t2014.05.22"
    },
    {
      "text": "輔仁大學資訊工程學系\t\"容錯系統\", 演講者, 2013.01.02"
    },
    {
      "text": "中央大學機械工程學系\t\"容錯與系統可靠性\", 演講者, 2012.12.20"
    },
    {
      "text": "聖約翰科大電腦與通訊工程系\t\"可靠計算\", 演講者, 2012.12.19"
    },
    {
      "text": "中央大學機械工程學系\t\"容錯系統\", 演講者, 2011.12.15"
    },
    {
      "text": "真理大學資訊工程研究所\t\"分散式容錯計算\", 演講者, 2010.05.10"
    },
    {
      "text": "交通大學資訊科學與工程研究所\t\"動態網路下協議問題之探討\", 演講者, 2009.12.09"
    },
    {
      "text": "中原大學資訊工程研究所\t\"容錯分散式系統 – 協議問題\", 演講者, 2009.04.27"
    }
  ],
  "evaluation": [
    {
      "text": "資旺盃Android程式設計競賽, 審查委員, 2014, 2016"
    },
    {
      "text": "馬偕護理專科學校計畫審查, 審查委員, 2014, 2015, 2016, 2017, 2018"
    },
    {
      "text": "台灣電腦 – Rimage商業應用程式介面設計創意競賽, 審查委員, 2011"
    },
    {
      "text": "經建會計畫審查, 複審委員, 2010, 2011, 2012"
    },
    {
      "text": "臺北市政府各局處約聘僱人員甄試 , 面試委員, 2009, 2010, 2011, 2012, 2013,  2015, 2016"
    }
  ]
}
